pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
//---------------------------------------------------------------------------*
//                                                                           *
//                   File 'pic18_intermediate_classes.h'                     *
//                        Generated by version 2.5.0                         *
//                      august 3rd, 2013, at 18h26'15"                       *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_intermediate_classes_ENTITIES_DEFINED
#define pic18_intermediate_classes_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_instructionList ;
class GALGAS_condionalBranchMode ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction ;
class GALGAS_pic_31__38__5F_intermediate_5F_NULL ;
class GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction ;
class GALGAS_pic_31__38__5F_intermediate_5F_JSR ;
class GALGAS_pic_31__38__5F_intermediate_5F_JUMP ;
class GALGAS_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W ;
class GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FA ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVLB ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation ;
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand ;
class GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register ;
class GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition ;
class GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL ;
class GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG ;
class GALGAS_pic_31__38__5F_intermediate_5F_word ;
class GALGAS_pic_31__38__5F_intermediate_5F_registerExpressionWithoutBSRIndication ;
class GALGAS_pic_31__38__5F_intermediate_5F_registerExpression ;
class GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//                 @pic18_intermediate_instructionList list                  *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_instructionList : public AC_GALGAS_list {
//--------------------------------- Default constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_instructionList (void) ;

//--------------------------------- List constructor used by listmap
  public : GALGAS_pic_31__38__5F_intermediate_5F_instructionList (cSharedList * inSharedListPtr) ;

//--------------------------------- Element constructor used by listmap
  public : static void makeAttributesFromObjects (capCollectionElement & outAttributes,
                                                  const GALGAS_pic_31__38__5F_intermediate_5F_instruction & in_mInstruction
                                                  COMMA_LOCATION_ARGS) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instructionList extractObject (const GALGAS_object & inObject,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instructionList constructor_emptyList (LOCATION_ARGS) ;

  public : static GALGAS_pic_31__38__5F_intermediate_5F_instructionList constructor_listWithValue (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & inOperand0
                                                                                                   COMMA_LOCATION_ARGS) ;

//--------------------------------- .= operator
  public : VIRTUAL_IN_DEBUG void dotAssign_operation (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList inOperand
                                                      COMMA_LOCATION_ARGS) ;

//--------------------------------- += operator
  public : VIRTUAL_IN_DEBUG void addAssign_operation (const GALGAS_pic_31__38__5F_intermediate_5F_instruction & inOperand0
                                                      COMMA_LOCATION_ARGS) ;
//--------------------------------- . (concat) operator
  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_instructionList operator_concat (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList & inOperand
                                                                                                   COMMA_LOCATION_ARGS) const ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction constinArgument0,
                                                         GALGAS_uint constinArgument1,
                                                         C_Compiler * inCompiler
                                                         COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_popFirst (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument0,
                                                    C_Compiler * inCompiler
                                                    COMMA_LOCATION_ARGS) ;

