pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
  public : VIRTUAL_IN_DEBUG void modifier_popLast (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument0,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_prependValue (GALGAS_pic_31__38__5F_intermediate_5F_instruction constinArgument0
                                                        COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction constinArgument0,
                                                                  GALGAS_uint constinArgument1,
                                                                  C_Compiler * inCompiler
                                                                  COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_first (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument0,
                                               C_Compiler * inCompiler
                                               COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG void method_last (GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument0,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_instruction reader_mInstructionAtIndex (const GALGAS_uint & constinOperand0,
                                                                                                          C_Compiler * inCompiler
                                                                                                          COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_instructionList reader_subListFromIndex (const GALGAS_uint & constinOperand0,
                                                                                                           C_Compiler * inCompiler
                                                                                                           COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_instructionList reader_subListWithRange (const GALGAS_range & constinOperand0,
                                                                                                           C_Compiler * inCompiler
                                                                                                           COMMA_LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- Friend

  friend class cEnumerator_pic_31__38__5F_intermediate_5F_instructionList ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_instructionList class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_pic_31__38__5F_intermediate_5F_instructionList : public cGenericAbstractEnumerator {
  public : cEnumerator_pic_31__38__5F_intermediate_5F_instructionList (const GALGAS_pic_31__38__5F_intermediate_5F_instructionList & inEnumeratedObject,
                                                                       const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction current_mInstruction (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instructionList ;

//---------------------------------------------------------------------------*
//                                                                           *
//                         @condionalBranchMode enum                         *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_condionalBranchMode : public AC_GALGAS_root {
//--------------------------------- Default constructor
  public : GALGAS_condionalBranchMode (void) ;

//--------------------------------- Enumeration
  public : typedef enum {
    kNotBuilt,
    kEnum_native,
    kEnum_ipicNative,
    kEnum_ipicBRA,
    kEnum_ipicGOTO
  } enumeration ;
  
//--------------------------------- Private data member
  private : enumeration mEnum ;

//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG inline bool isValid (void) const { return kNotBuilt != mEnum ; }
  public : VIRTUAL_IN_DEBUG inline void drop (void) { mEnum = kNotBuilt ; }
  public : inline enumeration enumValue (void) const { return mEnum ; }

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_condionalBranchMode extractObject (const GALGAS_object & inObject,
                                                            C_Compiler * inCompiler
                                                            COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_condionalBranchMode constructor_ipicBRA (LOCATION_ARGS) ;

  public : static GALGAS_condionalBranchMode constructor_ipicGOTO (LOCATION_ARGS) ;

