pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
class cPtr_pic_31__38__5F_intermediate_5F_actualInstruction ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction : public GALGAS_pic_31__38__5F_intermediate_5F_instruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (void) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_actualInstruction * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction (const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction * inSourcePtr) ;



//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction extractObject (const GALGAS_object & inObject,
                                                                                         C_Compiler * inCompiler
                                                                                         COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_location reader_mInstructionLocation (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction ;

//---------------------------------------------------------------------------*
//                                                                           *
//                 @pic_31__38__5F_intermediate_5F_JSR class                 *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_JSR ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_JSR : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_JSR (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_JSR constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_JSR * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_JSR * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_JSR *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_JSR (const cPtr_pic_31__38__5F_intermediate_5F_JSR * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_JSR extractObject (const GALGAS_object & inObject,
                                                                           C_Compiler * inCompiler
                                                                           COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_JSR constructor_new (const GALGAS_location & inOperand0,
                                                                             const GALGAS_lstring & inOperand1,
                                                                             const GALGAS_jumpInstructionKind & inOperand2
                                                                             COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_JSR & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_jumpInstructionKind reader_mKind (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_mTargetLabel (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_JSR class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR ;

//---------------------------------------------------------------------------*
//                                                                           *
//                @pic_31__38__5F_intermediate_5F_JUMP class                 *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_JUMP ;

//---------------------------------------------------------------------------*

