pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_MOV_5F_LABEL_5F_W ;

//---------------------------------------------------------------------------*
//                                                                           *
//      @pic_31__38__5F_intermediate_5F_incDecRegisterInCondition class      *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition extractObject (const GALGAS_object & inObject,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition constructor_new (const GALGAS_location & inOperand0,
                                                                                                   const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inOperand1,
                                                                                                   const GALGAS_lstring & inOperand2,
                                                                                                   const GALGAS_bool & inOperand3,
                                                                                                   const GALGAS_bool & inOperand4,
                                                                                                   const GALGAS_bool & inOperand5,
                                                                                                   const GALGAS_bool & inOperand6
                                                                                                   COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mBranchIfZero (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mIncrement (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_registerExpression reader_mRegisterDescription (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_mTargetLabel (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mUsesBra (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_m_5F_W_5F_isDestination (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition ;

//---------------------------------------------------------------------------*
//                                                                           *
//     @pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip class      *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


