pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA extractObject (const GALGAS_object & inObject,
                                                                                          C_Compiler * inCompiler
                                                                                          COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA constructor_new (const GALGAS_location & inOperand0,
                                                                                            const GALGAS_bit_5F_oriented_5F_op & inOperand1,
                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inOperand2,
                                                                                            const GALGAS_uint & inOperand3
                                                                                            COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mBitNumber (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bit_5F_oriented_5F_op reader_mBitOrientedOp (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_registerExpression reader_mRegisterDescription (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FBA ;

//---------------------------------------------------------------------------*
//                                                                           *
//         @pic_31__38__5F_intermediate_5F_instruction_5F_FDA class          *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA extractObject (const GALGAS_object & inObject,
                                                                                          C_Compiler * inCompiler
                                                                                          COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA constructor_new (const GALGAS_location & inOperand0,
                                                                                            const GALGAS_instruction_5F_FDA_5F_base_5F_code & inOperand1,
                                                                                            const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inOperand2,
                                                                                            const GALGAS_bool & inOperand3
                                                                                            COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_instruction_5F_FDA_5F_base_5F_code reader_mInstruction_5F_FDA_5F_base_5F_code (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_registerExpression reader_mRegisterDescription (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_m_5F_W_5F_isDestination (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_FDA class


//---------------------------------------------------------------------------*

