pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch extractObject (const GALGAS_object & inObject,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch constructor_new (const GALGAS_location & inOperand0,
                                                                                                          const GALGAS_condionalBranchMode & inOperand1,
                                                                                                          const GALGAS_conditional_5F_branch & inOperand2,
                                                                                                          const GALGAS_lstring & inOperand3
                                                                                                          COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_condionalBranchMode reader_mBranchMode (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_conditional_5F_branch reader_mConditionalBranch (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_mTargetLabel (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch ;

//---------------------------------------------------------------------------*
//                                                                           *
//   @pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation class   *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation extractObject (const GALGAS_object & inObject,
                                                                                                       C_Compiler * inCompiler
                                                                                                       COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation constructor_new (const GALGAS_location & inOperand0,
                                                                                                         const GALGAS_literal_5F_instruction_5F_opcode & inOperand1,
                                                                                                         const GALGAS_uint & inOperand2
                                                                                                         COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_literal_5F_instruction_5F_opcode reader_mLiteralInstruction (LOCATION_ARGS) const ;

