pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mLiteralValue (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation ;

//---------------------------------------------------------------------------*
//                                                                           *
//    @pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand class     *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand extractObject (const GALGAS_object & inObject,
                                                                                                    C_Compiler * inCompiler
                                                                                                    COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand constructor_new (const GALGAS_location & inOperand0,
                                                                                                      const GALGAS_pic_31__38_InstructionWithNoOperandKind & inOperand1
                                                                                                      COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38_InstructionWithNoOperandKind reader_mKind (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand ;

//---------------------------------------------------------------------------*
//                                                                           *
//      @pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register class       *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register extractObject (const GALGAS_object & inObject,
                                                                                                C_Compiler * inCompiler
                                                                                                COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register constructor_new (const GALGAS_location & inOperand0,
                                                                                                  const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inOperand1
                                                                                                  COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_registerExpression reader_mRegisterDescription (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register class


//---------------------------------------------------------------------------*

