pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register ;

//---------------------------------------------------------------------------*
//                                                                           *
//     @pic_31__38__5F_intermediate_5F_registerComparisonCondition class     *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition : public GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition extractObject (const GALGAS_object & inObject,
                                                                                                   C_Compiler * inCompiler
                                                                                                   COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition constructor_new (const GALGAS_location & inOperand0,
                                                                                                     const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inOperand1,
                                                                                                     const GALGAS_lstring & inOperand2,
                                                                                                     const GALGAS_pic_31__38_RegisterComparison & inOperand3,
                                                                                                     const GALGAS_bool & inOperand4
                                                                                                     COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38_RegisterComparison reader_mComparison (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_registerExpression reader_mRegisterDescription (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_mTargetLabel (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mUsesBra (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition ;

//---------------------------------------------------------------------------*
//                                                                           *
//           @pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL class           *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL : public GALGAS_pic_31__38__5F_intermediate_5F_instruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


