pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL extractObject (const GALGAS_object & inObject,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL constructor_new (const GALGAS_lstring & inOperand0,
                                                                                         const GALGAS_bool & inOperand1
                                                                                         COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mIsDeletable (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_mLabel (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL ;

//---------------------------------------------------------------------------*
//                                                                           *
//            @pic_31__38__5F_intermediate_5F_pseudo_5F_ORG class            *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG : public GALGAS_pic_31__38__5F_intermediate_5F_instruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG extractObject (const GALGAS_object & inObject,
                                                                                     C_Compiler * inCompiler
                                                                                     COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG constructor_new (const GALGAS_uint & inOperand0
                                                                                       COMMA_LOCATION_ARGS) ;

//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mOrigin (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG ;

//---------------------------------------------------------------------------*
//                                                                           *
//                @pic_31__38__5F_intermediate_5F_word class                 *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_word ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_word : public GALGAS_pic_31__38__5F_intermediate_5F_instruction {
//--- Constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_word (void) ;

//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_word constructor_default (LOCATION_ARGS) ;

//---
  public : inline const cPtr_pic_31__38__5F_intermediate_5F_word * ptr (void) const { return (const cPtr_pic_31__38__5F_intermediate_5F_word *) mObjectPtr ; }
  public : inline cPtr_pic_31__38__5F_intermediate_5F_word * ptr (void) { return (cPtr_pic_31__38__5F_intermediate_5F_word *) mObjectPtr ; }

//--------------------------------- Constructor from pointer
  public : GALGAS_pic_31__38__5F_intermediate_5F_word (const cPtr_pic_31__38__5F_intermediate_5F_word * inSourcePtr) ;

//--- Insulate
  public : VIRTUAL_IN_DEBUG void insulate (LOCATION_ARGS) ;


