pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
//--------------------------------- Default GALGAS constructor
  public : static GALGAS_pic_31__38__5F_intermediate_5F_registerExpression constructor_default (LOCATION_ARGS) ;

//--------------------------------- Default constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_registerExpression (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_pic_31__38__5F_intermediate_5F_registerExpression (void) ;

//--------------------------------- Native constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_registerExpression (const GALGAS_string & in_mAssemblyString,
                                                                     const GALGAS_uint & in_mRegisterAddress,
                                                                     const GALGAS_bool & in_mNeedsBSR) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_registerExpression extractObject (const GALGAS_object & inObject,
                                                                                          C_Compiler * inCompiler
                                                                                          COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_registerExpression constructor_new (const GALGAS_string & inOperand0,
                                                                                            const GALGAS_uint & inOperand1,
                                                                                            const GALGAS_bool & inOperand2
                                                                                            COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_string reader_mAssemblyString (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mNeedsBSR (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mRegisterAddress (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_registerExpression class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerExpression ;

//---------------------------------------------------------------------------*
//                                                                           *
//            Category method '@registerExpression resolveAccess'            *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_registerExpression_resolveAccess) (const cPtr_registerExpression * inObject,
                                                                          const GALGAS_uint constinArgument0,
                                                                          const GALGAS_uint constinArgument1,
                                                                          const GALGAS_registerTable constinArgument2,
                                                                          GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & outArgument3,
                                                                          GALGAS_bitSliceTable & outArgument4,
                                                                          C_Compiler * inCompiler
                                                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_resolveAccess (const PMSInt32 inClassIndex,
                                        categoryMethodSignature_registerExpression_resolveAccess inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_resolveAccess (const cPtr_registerExpression * inObject,
                                       const GALGAS_uint constin_inAccessBankSplitOffset,
                                       const GALGAS_uint constin_inCurrentBank,
                                       const GALGAS_registerTable constin_inRegisterTable,
                                       GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & out_outIPICregisterDescription,
                                       GALGAS_bitSliceTable & out_outBitSliceTable,
                                       C_Compiler * inCompiler
                                       COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Category method '@registerExpression resolveAccessWithoutCheckingBank'   *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_registerExpression_resolveAccessWithoutCheckingBank) (const cPtr_registerExpression * inObject,
                                                                                             const GALGAS_registerTable constinArgument0,
                                                                                             GALGAS_pic_31__38__5F_intermediate_5F_registerExpressionWithoutBSRIndication & outArgument1,
                                                                                             C_Compiler * inCompiler
                                                                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_resolveAccessWithoutCheckingBank (const PMSInt32 inClassIndex,
                                                           categoryMethodSignature_registerExpression_resolveAccessWithoutCheckingBank inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_resolveAccessWithoutCheckingBank (const cPtr_registerExpression * inObject,
                                                          const GALGAS_registerTable constin_inRegisterTable,
                                                          GALGAS_pic_31__38__5F_intermediate_5F_registerExpressionWithoutBSRIndication & out_outIPICregisterDescription,
                                                          C_Compiler * inCompiler
                                                          COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//           Category reader '@registerExpression registerAddress'           *
//                                                                           *
//---------------------------------------------------------------------------*

typedef GALGAS_uint (*categoryReaderSignature_registerExpression_registerAddress) (const cPtr_registerExpression * inObject,
                                                                                   const GALGAS_registerTable & constinArgument0,
                                                                                   C_Compiler * inCompiler
                                                                                   COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

