pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
void enterCategoryReader_registerAddress (const PMSInt32 inClassIndex,
                                          categoryReaderSignature_registerExpression_registerAddress inReader) ;

//---------------------------------------------------------------------------*

GALGAS_uint callCategoryReader_registerAddress (const cPtr_registerExpression * inObject,
                                                const GALGAS_registerTable & constin_inRegisterTable,
                                                C_Compiler * inCompiler
                                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//    Abstract category method '@pic18_intermediate_instruction display'     *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_display) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                            GALGAS_string & ioArgument0,
                                                                                            C_Compiler * inCompiler
                                                                                            COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_display (const PMSInt32 inClassIndex,
                                  categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_display inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_display (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                 GALGAS_string & io_ioListFileContents,
                                 C_Compiler * inCompiler
                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//      Category method '@pic18_intermediate_instruction isLABELorORG'       *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                 GALGAS_bool & outArgument0,
                                                                                                 C_Compiler * inCompiler
                                                                                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_isLABELorORG (const PMSInt32 inClassIndex,
                                       categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isLABELorORG inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_isLABELorORG (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                      GALGAS_bool & out_outIsLABELorORG,
                                      C_Compiler * inCompiler
                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//         Category method '@pic18_intermediate_instruction isNULL'          *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isNULL) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                           GALGAS_bool & outArgument0,
                                                                                           C_Compiler * inCompiler
                                                                                           COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_isNULL (const PMSInt32 inClassIndex,
                                 categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_isNULL inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_isNULL (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                GALGAS_bool & out_outIsNULL,
                                C_Compiler * inCompiler
                                COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Category reader '@pic18_intermediate_instruction isSkippingInstruction'  *
//                                                                           *
//---------------------------------------------------------------------------*

typedef GALGAS_bool (*categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                 C_Compiler * inCompiler
                                                                                                                 COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

