pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
void enterCategoryReader_isSkippingInstruction (const PMSInt32 inClassIndex,
                                                categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_isSkippingInstruction inReader) ;

//---------------------------------------------------------------------------*

GALGAS_bool callCategoryReader_isSkippingInstruction (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                      C_Compiler * inCompiler
                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Category method '@pic18_intermediate_instruction enterReferencedLabel'   *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         GALGAS_stringset & ioArgument0,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_enterReferencedLabel (const PMSInt32 inClassIndex,
                                               categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_enterReferencedLabel inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_enterReferencedLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                              GALGAS_stringset & io_ioReferencedLabelSet,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Category method '@pic18_intermediate_instruction_FDA getBaseCode'     *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * inObject,
                                                                                                       GALGAS_uint & outArgument0,
                                                                                                       C_Compiler * inCompiler
                                                                                                       COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FDA_getBaseCode inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FDA * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Category method '@pic18_intermediate_instruction_FA getBaseCode'      *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * inObject,
                                                                                                      GALGAS_uint & outArgument0,
                                                                                                      C_Compiler * inCompiler
                                                                                                      COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FA_getBaseCode inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FA * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     Category method '@pic18_intermediate_instruction_FBA getBaseCode'     *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * inObject,
                                                                                                       GALGAS_uint & outArgument0,
                                                                                                       C_Compiler * inCompiler
                                                                                                       COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_FBA_getBaseCode inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_FBA * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Category method '@pic18_intermediate_instruction_BitTestSkip getBaseCode' *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                                                                                               GALGAS_uint & outArgument0,
                                                                                                               C_Compiler * inCompiler
                                                                                                               COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_getBaseCode inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_literalOperation getBaseCode'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode) (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                                                                                                    GALGAS_uint & outArgument0,
                                                                                                                    C_Compiler * inCompiler
                                                                                                                    COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_getBaseCode (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_getBaseCode inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_getBaseCode (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                     GALGAS_uint & out_outBaseCode,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_registerComparisonCondition usesIntermediateBRA'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA) (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                                                                                                        GALGAS_bool & outArgument0,
                                                                                                                        C_Compiler * inCompiler
                                                                                                                        COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_usesIntermediateBRA (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_usesIntermediateBRA inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_usesIntermediateBRA (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                             GALGAS_bool & out_outUses,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//     @pic_31__38__5F_intermediate_5F_instructionList_2E_element struct     *
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_pic_31__38__5F_intermediate_5F_instruction mAttribute_mInstruction ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_instructionList_2E_element (void) ;

