pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_bool mAttribute_mFastReturn ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETFIE (const GALGAS_location & in_mInstructionLocation,
                                                                      const GALGAS_bool & in_mFastReturn
                                                                      COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mFastReturn (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Pointer class for @pic18_intermediate_instruction_RETLW class       *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_uint mAttribute_mLiteralValue ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW (const GALGAS_location & in_mInstructionLocation,
                                                                     const GALGAS_uint & in_mLiteralValue
                                                                     COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mLiteralValue (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//      Pointer class for @pic18_intermediate_instruction_RETURN class       *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN (const GALGAS_location & in_mInstructionLocation
                                                                      COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//Pointer class for @pic18_intermediate_instruction_RETURN_NOT_OPTIMIZABLE class*
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN_5F_NOT_5F_OPTIMIZABLE (const GALGAS_location & in_mInstructionLocation
                                                                                            COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Pointer class for @pic18_intermediate_instruction_TBLRD class       *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_tableAccessOption mAttribute_mOption ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLRD (const GALGAS_location & in_mInstructionLocation,
                                                                     const GALGAS_tableAccessOption & in_mOption
                                                                     COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_tableAccessOption reader_mOption (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//       Pointer class for @pic18_intermediate_instruction_TBLWT class       *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_tableAccessOption mAttribute_mOption ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_TBLWT (const GALGAS_location & in_mInstructionLocation,
                                                                     const GALGAS_tableAccessOption & in_mOption
                                                                     COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_tableAccessOption reader_mOption (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Pointer class for @pic18_intermediate_instruction_computed_bra class    *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_lstringlist mAttribute_mTargetLabels ;
  public : GALGAS_bool mAttribute_mUsesRCALL ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra (const GALGAS_location & in_mInstructionLocation,
                                                                               const GALGAS_lstringlist & in_mTargetLabels,
                                                                               const GALGAS_bool & in_mUsesRCALL
                                                                               COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_lstringlist reader_mTargetLabels (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Pointer class for @pic18_intermediate_instruction_computed_goto class   *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_lstringlist mAttribute_mTargetLabels ;
  public : GALGAS_bool mAttribute_mUsesRCALL ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto (const GALGAS_location & in_mInstructionLocation,
                                                                                const GALGAS_lstringlist & in_mTargetLabels,
                                                                                const GALGAS_bool & in_mUsesRCALL
                                                                                COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_lstringlist reader_mTargetLabels (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Pointer class for @pic18_intermediate_instruction_computed_rcall class   *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_lstringlist mAttribute_mTargetLabels ;
  public : GALGAS_string mAttribute_mEndOfInstructionLabel ;
  public : GALGAS_bool mAttribute_mUsesRCALL ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall (const GALGAS_location & in_mInstructionLocation,
                                                                                 const GALGAS_lstringlist & in_mTargetLabels,
                                                                                 const GALGAS_string & in_mEndOfInstructionLabel,
                                                                                 const GALGAS_bool & in_mUsesRCALL
                                                                                 COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_lstringlist reader_mTargetLabels (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_string reader_mEndOfInstructionLabel (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Pointer class for @pic18_intermediate_instruction_computed_retlw class   *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_uintlist mAttribute_mLiteralValues ;
  public : GALGAS_bool mAttribute_mUsesRCALL ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw (const GALGAS_location & in_mInstructionLocation,
                                                                                 const GALGAS_uintlist & in_mLiteralValues,
                                                                                 const GALGAS_bool & in_mUsesRCALL
                                                                                 COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_uintlist reader_mLiteralValues (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_bool reader_mUsesRCALL (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
// Pointer class for @pic18_intermediate_instruction_conditionalBranch class *
//                                                                           *
//---------------------------------------------------------------------------*

