pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes.h
class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_condionalBranchMode mAttribute_mBranchMode ;
  public : GALGAS_conditional_5F_branch mAttribute_mConditionalBranch ;
  public : GALGAS_lstring mAttribute_mTargetLabel ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch (const GALGAS_location & in_mInstructionLocation,
                                                                                 const GALGAS_condionalBranchMode & in_mBranchMode,
                                                                                 const GALGAS_conditional_5F_branch & in_mConditionalBranch,
                                                                                 const GALGAS_lstring & in_mTargetLabel
                                                                                 COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_condionalBranchMode reader_mBranchMode (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_conditional_5F_branch reader_mConditionalBranch (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_mTargetLabel (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
// Pointer class for @pic18_intermediate_instruction_literalOperation class  *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_literal_5F_instruction_5F_opcode mAttribute_mLiteralInstruction ;
  public : GALGAS_uint mAttribute_mLiteralValue ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation (const GALGAS_location & in_mInstructionLocation,
                                                                                const GALGAS_literal_5F_instruction_5F_opcode & in_mLiteralInstruction,
                                                                                const GALGAS_uint & in_mLiteralValue
                                                                                COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_literal_5F_instruction_5F_opcode reader_mLiteralInstruction (UNUSED_LOCATION_ARGS) const ;
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mLiteralValue (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//   Pointer class for @pic18_intermediate_instruction_withNoOperand class   *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_pic_31__38_InstructionWithNoOperandKind mAttribute_mKind ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_withNoOperand (const GALGAS_location & in_mInstructionLocation,
                                                                             const GALGAS_pic_31__38_InstructionWithNoOperandKind & in_mKind
                                                                             COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38_InstructionWithNoOperandKind reader_mKind (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//      Pointer class for @pic18_intermediate_jump_test_register class       *
//                                                                           *
//---------------------------------------------------------------------------*

class cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register : public cPtr_pic_31__38__5F_intermediate_5F_actualInstruction {
//--- Attributes
  public : GALGAS_pic_31__38__5F_intermediate_5F_registerExpression mAttribute_mRegisterDescription ;

//--- Constructor
  public : cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register (const GALGAS_location & in_mInstructionLocation,
                                                                         const GALGAS_pic_31__38__5F_intermediate_5F_registerExpression & in_mRegisterDescription
                                                                         COMMA_LOCATION_ARGS) ;

//--- Attribute accessors
  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_registerExpression reader_mRegisterDescription (UNUSED_LOCATION_ARGS) const ;
//--- Description
  public : virtual void description (C_String & ioString,
                                     const PMSInt32 inIndentation) const ;

  public : virtual typeComparisonResult dynamicObjectCompare (const acPtr_class * inOperandPtr) const ;

  public : virtual const C_galgas_type_descriptor * classDescriptor (void) const ;

} ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Pointer class for @pic18_intermediate_registerComparisonCondition class  *
//                                                                           *
//---------------------------------------------------------------------------*

